azure/repind-ri-ws/api/CreateOrUpdateIndividualWS/v8/Regression Tests/CreateUpdate Type T/Update.bru

meta {
  name: Update
  type: http
  seq: 2
}

post {
  url: {{create-or-update-individual-v8-url}}
  body: xml
  auth: none
}

headers {
  SOAPAction: "http://www.af-klm.com/services/passenger/CreateUpdateIndividualService-v8/createIndividual"
}

body:xml {
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Body>
          <ns2:CreateUpdateIndividualRequestElement xmlns:ns6="http://www.af-klm.com/services/passenger/SicCommonType-v1/xsd"
              xmlns:ns5="http://www.af-klm.com/services/passenger/request-v8/xsd"
              xmlns:ns8="http://www.af-klm.com/services/passenger/SicOsirisType-v1/xsd"
              xmlns:ns7="http://www.af-klm.com/services/passenger/SoftComputingType-v1/xsd"
              xmlns:ns2="http://www.af-klm.com/services/passenger/data-v8/xsd"
              xmlns:ns4="http://www.af-klm.com/services/passenger/response-v8/xsd"
              xmlns:ns3="http://www.af-klm.com/services/passenger/SicIndividuType-v3/xsd">
              <process>W</process>
              <requestor>
                  <channel>B2C</channel>
                  <context>B2C_HOME_PAGE</context>
                  <site>QVI</site>
                  <signature>REGRESSION</signature>
              </requestor>
              <individualRequest>
                  <individualInformations>
                      <identifier>{{gin_create}}</identifier>
                  </individualInformations>
              </individualRequest>
              <comunicationPreferencesRequest>
                  <communicationPreferences>
                      <domain>S</domain>
                      <communicationGroupeType>N</communicationGroupeType>
                      <communicationType>KL</communicationType>
                      <optIn>N</optIn>
                      <dateOfConsent>2019-04-18T13:07:46Z</dateOfConsent>
                      <subscriptionChannel>B2C Home page</subscriptionChannel>
                      <media>
                          <media1>E</media1>
                      </media>
                      <marketLanguage>
                          <market>NL</market>
                          <language>EN</language>
                          <optIn>N</optIn>
                          <dateOfConsent>2019-04-18T13:09:11.535Z</dateOfConsent>
                          <media>
                              <media1>E</media1>
                          </media>
                      </marketLanguage>
                      <marketLanguage>
                          <market>FR</market>
                          <language>FR</language>
                          <optIn>N</optIn>
                          <dateOfConsent>2022-10-21T00:00:00Z</dateOfConsent>
                          <media>
                              <media1>E</media1>
                          </media>
                      </marketLanguage>
                      <marketLanguage>
                          <market>IN</market>
                          <language>EN</language>
                          <optIn>N</optIn>
                          <dateOfConsent>2022-10-24T00:00:00Z</dateOfConsent>
                          <media>
                              <media1>E</media1>
                          </media>
                      </marketLanguage>
                      <marketLanguage>
                          <market>IT</market>
                          <language>IT</language>
                          <optIn>N</optIn>
                          <dateOfConsent>2022-10-24T13:17:21Z</dateOfConsent>
                          <media>
                              <media1>E</media1>
                          </media>
                      </marketLanguage>
                  </communicationPreferences>
              </comunicationPreferencesRequest>
          </ns2:CreateUpdateIndividualRequestElement>
      </soapenv:Body>
  </soapenv:Envelope>
}

vars:pre-request {
  USER: W90000442
  PASSWORD: pswpsw123
}

vars:post-response {
  gin_create: null
}

assert {
  res.status: eq 200
}
